// src/data/food/vegetableData.js


export const VEGETABLE_DATA = {

  2: "大米",

  3: "小麦",

  4: "糯米",

  5: "黄豆",

  6: "麦芽",

  7: "土豆",

  8: "糙米",

  9: "面粉",

  10: "毛豆",

  11: "白菜",

  12: "米粉",

  13: "香菇",

  14: "萝卜",

  15: "豌豆",

  16: "黑米",

  17: "南瓜",

  18: "麦仁",

  19: "番茄",

  20: "豆腐",

  21: "山药",

  22: "菠菜",

  23: "海带",

  24: "米浆",

  25: "豆皮",

  26: "平菇",

  27: "全麦",

  28: "芋头",

  29: "大葱",

  30: "豆芽",

  31: "竹笋",

  32: "紫米",

  33: "生菜",

  34: "冬瓜",

  35: "莲藕",

  36: "燕麦",

  37: "花生",

  38: "茄子",

  39: "口蘑",

  40: "黑豆",

  41: "芝麻",

  42: "芋艿",

  43: "百合",

  44: "油麦菜",

  45: "绿豆",

  46: "紫菜",

  47: "莲子",

  48: "薏米",

  49: "紫薯",

  50: "豆干",

  51: "黄瓜",

  52: "木耳",

  53: "栗子",

  54: "麦麸",

  55: "油菜",

  56: "牛蒡",

  57: "秋葵",

  58: "洋葱",

  59: "核桃",

  60: "腐竹",

  61: "腰果",

  62: "芦笋",

  63: "荸荠",

  64: "香米",

  65: "银耳",

  66: "菜心",

  67: "芡实",

  68: "丝瓜",

  69: "裙带菜",

  70: "葛根",

  71: "银杏",

  72: "米线",

  73: "椰肉",

  74: "花生仁",

  75: "蚕豆",

  76: "彩椒",

  77: "菱角",

  78: "杏鲍菇",

  79: "橄榄",

  80: "红豆",

  81: "麦胚",

  82: "芝麻仁",

  83: "菜蓟",

  84: "魔芋",

  85: "苦瓜",

  86: "鲜百合",

  87: "韭菜",

  88: "茼蒿",

  89: "棕榈芯",

  90: "面筋",

  91: "慈姑",

  92: "海葡萄",

  93: "莴笋",

  94: "莲心",

  95: "辣椒",

  96: "稻米",

  97: "仙人掌",

  98: "红薯",

  99: "芥菜",

  100: "豆乳",

  101: "雪燕",

};


export function getVegetableName(value) {

  return (

    VEGETABLE_DATA[value] ??

    String(value)

  );

}


export function getVegetable(value) {

  return (

    VEGETABLE_DATA[value] ??

    null

  );

}