// src/data/animal/birdData.js


export const BIRD_DATA = {

  2: "麻雀",

  3: "鸽子",

  4: "山雀",

  5: "鸡",

  6: "灰鸽",

  7: "鸭子",

  8: "云雀",

  9: "斑鸠",

  10: "芦花鸡",

  11: "鹅",

  12: "鹌鹑",

  13: "燕子",

  14: "花鸭",

  15: "乌鸡",

  16: "黄雀",

  17: "喜鹊",

  18: "雪鸽",

  19: "乌鸦",

  20: "珍珠鸡",

  21: "鸬鹚",

  22: "大雁",

  23: "鹦鹉",

  24: "金丝雀",

  25: "锦鸡",

  26: "家燕",

  27: "信鸽",

  28: "绿头鸭",

  29: "八哥",

  30: "火鸡",

  31: "啄木鸟",

  32: "文鸟",

  33: "灰雁",

  34: "蓝鹊",

  35: "野鸭",

  36: "岩鸽",

  37: "猫头鹰",

  38: "寒鸦",

  39: "雨燕",

  40: "山鸡",

  41: "翠鸟",

  42: "花喜鹊",

  43: "海鸥",

  44: "鸿雁",

  45: "白鹇",

  46: "虎皮鹦",

  47: "鹤",

  48: "百灵鸟",

  49: "鸳鸯",

  50: "乌骨鸡",

  51: "红喜鹊",

  52: "白燕",

  53: "孔雀",

  54: "原鸽",

  55: "白鹅",

  56: "麻鸭",

  57: "渡鸦",

  58: "灰八哥",

  59: "天鹅",

  60: "花鸡",

  61: "企鹅",

  62: "灰鹦鹉",

  63: "斑嘴鸭",

  64: "百灵",

  65: "楼燕",

  66: "豆雁",

  67: "鸵鸟",

  68: "红嘴鹊",

  69: "玄凤",

  70: "番鸭",

  71: "火烈鸟",

  72: "家鸽",

  73: "信天翁",

  74: "白头翁",

  75: "竹鸡",

  76: "秃鼻鸦",

  77: "斑头雁",

  78: "金腰燕",

  79: "鹈鹕",

  80: "三黄鸡",

  81: "白鸽",

  82: "蓝翡翠",

  83: "蜂鸟",

  84: "花脸鸭",

  85: "红腹锦",

  86: "燕鸥",

  87: "鹩哥",

  88: "雪雁",

  89: "朱鹮",

  90: "贵妃鸡",

  91: "岩燕",

  92: "和尚鹦",

  93: "黑啄木",

  94: "黑天鹅",

  95: "红嘴鸦",

  96: "芙蓉鸟",

  97: "金雕",

  98: "赤麻鸭",

  99: "白额雁",

  100: "丝羽鸡",

  101: "凤凰",

};


export function getBirdName(value) {

  return (

    BIRD_DATA[value] ??

    String(value)

  );

}


export function getBird(value) {

  return (

    BIRD_DATA[value] ??

    null

  );

}