// src/data/animal/dogData.js


export const DOG_DATA = {

  2: "白狗",

  3: "黑狗",

  4: "白犬",

  5: "土狗",

  6: "斑点犬",

  7: "柴犬",

  8: "雪犬",

  9: "墨犬",

  10: "黄白犬",

  11: "柯基",

  12: "边牧",

  13: "博美",

  14: "白柴",

  15: "黄狗",

  16: "白狐犬",

  17: "比熊",

  18: "踏雪犬",

  19: "贵宾",

  20: "田园犬",

  21: "黑柴",

  22: "卡迪根",

  23: "金毛",

  24: "黑白犬",

  25: "黄犬",

  26: "蝴蝶犬",

  27: "玄犬",

  28: "赤白柴",

  29: "拉布拉",

  30: "中华犬",

  31: "哈士奇",

  32: "银狐犬",

  33: "彭布罗",

  34: "白比熊",

  35: "狼狗",

  36: "大麦町",

  37: "萨摩耶",

  38: "泰迪犬",

  39: "狐狸犬",

  40: "沙皮犬",

  41: "秋田犬",

  42: "米克斯",

  43: "松狮",

  44: "短腿犬",

  45: "土猎犬",

  46: "奶油犬",

  47: "吉娃娃",

  48: "花斑犬",

  49: "赤柴",

  50: "黄白犬",

  51: "卷毛犬",

  52: "白博美",

  53: "腊肠犬",

  54: "黑背犬",

  55: "京巴犬",

  56: "雪橇犬",

  57: "黑贵宾",

  58: "寻回犬",

  59: "灵缇",

  60: "沙皮犬",

  61: "德牧",

  62: "雪哈士",

  63: "黑柴犬",

  64: "白熊犬",

  65: "巴哥犬",

  66: "牧牛犬",

  67: "杜宾",

  68: "西高地",

  69: "金毛犬",

  70: "狼青犬",

  71: "马犬",

  72: "喜乐蒂",

  73: "藏獒",

  74: "大白熊",

  75: "细犬",

  76: "巨贵",

  77: "柴柯基",

  78: "斗牛犬",

  79: "野犬",

  80: "罗威纳",

  81: "黑猎犬",

  82: "白秋田",

  83: "豺",

  84: "花柴犬",

  85: "卷土犬",

  86: "雪松狮",

  87: "黑拉布",

  88: "威尔士",

  89: "郊狼",

  90: "花田园",

  91: "柴博美",

  92: "奶金毛",

  93: "黑哈士",

  94: "白吉娃",

  95: "土贵宾",

  96: "雪斑犬",

  97: "鬃狼",

  98: "赤白柴",

  99: "黑柯基",

  100: "大丹犬",

  101: "灰狼",

};


export function getDogName(value) {

  return (

    DOG_DATA[value] ??

    String(value)

  );

}


export function getDog(value) {

  return (

    DOG_DATA[value] ??

    null

  );

}