// src/data/animal/mammalData.js


export const MAMMAL_DATA = {

  2: "老鼠",

  3: "兔子",

  4: "仓鼠",

  5: "猪",

  6: "鼠兔",

  7: "浣熊",

  8: "松鼠",

  9: "垂耳兔",

  10: "豚鼠",

  11: "羊",

  12: "荷兰兔",

  13: "牛",

  14: "栗鼠",

  15: "香猪",

  16: "花栗鼠",

  17: "马",

  18: "雪兔",

  19: "鹿",

  20: "荷兰猪",

  21: "果子狸",

  22: "绵羊",

  23: "羊驼",

  24: "花枝鼠",

  25: "野猪",

  26: "奶牛",

  27: "侏儒兔",

  28: "赤浣熊",

  29: "猴子",

  30: "乳猪",

  31: "水豚",

  32: "龙猫",

  33: "山羊",

  34: "白马",

  35: "花猪",

  36: "灰兔",

  37: "袋鼠",

  38: "白鹿",

  39: "黄牛",

  40: "黑猪",

  41: "河狸",

  42: "花狸",

  43: "海獭",

  44: "羔羊",

  45: "家猪",

  46: "白羊驼",

  47: "小熊猫",

  48: "白仓鼠",

  49: "灰浣熊",

  50: "黑山猪",

  51: "黑马",

  52: "水牛",

  53: "毛驴",

  54: "长毛兔",

  55: "盘羊",

  56: "狸鼠",

  57: "马鹿",

  58: "猕猴",

  59: "猩猩",

  60: "斑猪",

  61: "棕熊",

  62: "白水豚",

  63: "野兔",

  64: "竹鼠",

  65: "牦牛",

  66: "卷毛羊",

  67: "野牛",

  68: "矮马",

  69: "黑羊驼",

  70: "疣猪",

  71: "野马",

  72: "安哥兔",

  73: "梅花鹿",

  74: "白河狸",

  75: "黑猪",

  76: "麋鹿",

  77: "岩羊",

  78: "花牛",

  79: "长尾猴",

  80: "肉猪",

  81: "安哥拉",

  82: "白海獭",

  83: "金丝猴",

  84: "花浣熊",

  85: "骏马",

  86: "灰袋鼠",

  87: "黑猴",

  88: "白山羊",

  89: "雪牛",

  90: "山猪",

  91: "黄牛",

  92: "灰羊驼",

  93: "黑猩猩",

  94: "红熊猫",

  95: "驯鹿",

  96: "白花鼠",

  97: "北极熊",

  98: "银浣熊",

  99: "黑山羊",

  100: "花野猪",

  101: "熊猫",

};


export function getMammalName(value) {

  return (

    MAMMAL_DATA[value] ??

    String(value)

  );

}


export function getMammal(value) {

  return (

    MAMMAL_DATA[value] ??

    null

  );

}